#include "stdio.h"

/*企业发放的奖金根据利润提成。
利润低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
利润高于20万元，低于40万元时，高于20万元的部分，可提成5%；
利润高于40万元，低于60万元时，高于40万元的部分，可提成3%；
利润高于60万元，低于100万元时，高于60万元的部分，可提成1.5%；
高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？*/

main()
{
    int i;
    while(1)
    {
        scanf("%d",&i);
        printf("i=%d\n",i);
        if(i<=10)
            printf("1");
        else if(i>10 && i<=20)
            printf("2");
        else if(i>20 && i<= 30)
            printf("3");
        else
            printf("4");
    }
}
/*
void main(void)
{
    double I,r;
    printf("请输入当月利润：\n");
    scanf("%lf",&I);
    I = I / 10000;
    if(I<=0)
    {
        printf("请输入正确的利润值！");
    }
    else if(I>0.0 && I<=10.0)
    {
        r = I * 0.1;
    }
    else if(I>10.0 && I<=20.0)
    {
        r = 10 * 0.1 + (I - 10) * 0.075;
    }
    else if(I>20.0 && I<=40.0)
    {
        r = 10 * 0.1 + 10 * 0.075 + (I-20)*0.05;
    }
    else if(I>40.0 && I<=60.0)
    {
        r = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + (I-40)*0.03;
    }
    else if(I>60.0 && I<=100.0)
    {
        r = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 40 * 0.03 + (I-60)*0.015;
    }
    else
    {
        r = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 40 * 0.03 + 40 * 0.015 + (I-100)*0.015;
    }
    printf("%.2f",r*10000);
}
*/
